OpenFOAM/clemdoe-v2312/ModifiedChtReactingEulerFoam/Case3_MeshExtA/constant/solido/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/solid";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    // Propiedades del Incoloy 800
	

    specie
    {
        molWeight       12;
    }
    equationOfState
    {
        rho             7940; 
    }
    transport
    {
        kappa           15.3; 
    }
    thermodynamics
    {
        Hf              0;
        Cp              511; 
    }
}

// ************************************************************************* //
