OpenFOAM/clemdoe-v2312/ModifiedChtReactingEulerFoam/Case3_MeshExtA/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 4.5e6;

boundaryField
{
    inlet_secundario
    {
        type            fixedFluxPressure;
    }

    outlet_secundario
    {	
        type            prghPressure;
        p               uniform 4.5e6;
        value           uniform 4.5e6;
    }

	front
    {
        type            wedge;
    }

	back
    {
        type            wedge;
    }

	region0_to_solido
    {
        type            fixedFluxPressure;
    }
    
    pared
    {
        type            fixedFluxPressure;
    }
    
}


// ************************************************************************* //
